Revit 2024 API
Connector.Coefficient Property
 The coefficient of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Coefficient { get; }
Visual Basic
Public ReadOnly Property Coefficient As Double
	Get
Visual C++
public:
property double Coefficient {
	double get ();
}
Remarks
 Instantaneous coefficient of this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This connector does not support flow calculation and associated properties.
See Also
Connector Class
Autodesk.Revit.DB Namespace